README.md
```mermaid
flowchart LR
    Qudi_Examples_GenericRegistration_NullComponentValidator_T_["NullComponentValidator#lt;T#gt;"]
    Qudi_Examples_GenericRegistration_BatteryValidator["BatteryValidator"]
    Qudi_Examples_GenericRegistration_IComponentValidator_Qudi_Examples_GenericRegistration_Battery_["IComponentValidator#lt;Battery#gt;"]
    Qudi_Examples_GenericRegistration_BatteryAnotherValidator["BatteryAnotherValidator"]
    Qudi_Examples_GenericRegistration_ScreenValidator["ScreenValidator"]
    Qudi_Examples_GenericRegistration_IComponentValidator_Qudi_Examples_GenericRegistration_Screen_["IComponentValidator#lt;Screen#gt;"]
    Qudi_Examples_GenericRegistration_GenericRegistrationExecutor["GenericRegistrationExecutor"]
    Qudi_Examples_GenericRegistration_IComponentValidator_Qudi_Examples_GenericRegistration_Keyboard_["IComponentValidator#lt;Keyboard#gt;"]
    Qudi_Examples_GenericRegistration_IComponentValidator_Qudi_Examples_GenericRegistration_Battery_ --> Qudi_Examples_GenericRegistration_BatteryValidator
    Qudi_Examples_GenericRegistration_IComponentValidator_Qudi_Examples_GenericRegistration_Battery_ --> Qudi_Examples_GenericRegistration_BatteryAnotherValidator
    Qudi_Examples_GenericRegistration_IComponentValidator_Qudi_Examples_GenericRegistration_Screen_ --> Qudi_Examples_GenericRegistration_ScreenValidator
    Qudi_Examples_GenericRegistration_GenericRegistrationExecutor -.->|"*"| Qudi_Examples_GenericRegistration_IComponentValidator_Qudi_Examples_GenericRegistration_Battery_
    Qudi_Examples_GenericRegistration_GenericRegistrationExecutor -.->|"*"| Qudi_Examples_GenericRegistration_IComponentValidator_Qudi_Examples_GenericRegistration_Screen_
    Qudi_Examples_GenericRegistration_GenericRegistrationExecutor -.->|"*"| Qudi_Examples_GenericRegistration_IComponentValidator_Qudi_Examples_GenericRegistration_Keyboard_
    Qudi_Examples_GenericRegistration_IComponentValidator_Qudi_Examples_GenericRegistration_Keyboard_ --> Qudi_Examples_GenericRegistration_NullComponentValidator_T_
    classDef missing stroke:#c00,stroke-width:2px,stroke-dasharray:5 5;
    class Qudi_Examples_GenericRegistration_IComponentValidator_Qudi_Examples_GenericRegistration_Keyboard_ missing;
    classDef interface fill:#c8e6c9,stroke:#4caf50,stroke-width:2px,color:#000;
    class Qudi_Examples_GenericRegistration_IComponentValidator_Qudi_Examples_GenericRegistration_Battery_ interface;
    class Qudi_Examples_GenericRegistration_IComponentValidator_Qudi_Examples_GenericRegistration_Screen_ interface;
    classDef cls fill:#bbdefb,stroke:#2196f3,stroke-width:2px,color:#000;
    class Qudi_Examples_GenericRegistration_NullComponentValidator_T_ cls;
    class Qudi_Examples_GenericRegistration_BatteryValidator cls;
    class Qudi_Examples_GenericRegistration_BatteryAnotherValidator cls;
    class Qudi_Examples_GenericRegistration_ScreenValidator cls;
    class Qudi_Examples_GenericRegistration_GenericRegistrationExecutor cls;

```
